# -*- fill-column: 69; org-confirm-babel-evaluate: nil -*-

#+TITLE: YANG Module Tags
#+AUTHOR: Christian Hopps
#+EMAIL: chopps@chopps.org
#+AFFILIATION: LabN Consulting, L.L.C.
#+RFC_ADD_AUTHOR: ("Lou Berger" "lberger@labn.net" "LabN Consulting, LLC.")
#+RFC_ADD_AUTHOR: ("Dean Bogdanovic" "ivandean@gmail.com" "Volta Networks")
#+RFC_NAME: draft-ietf-netmod-module-tags
#+RFC_UPDATES: 8407
#+RFC_VERSION: 08
#+RFC_XML_VERSION: 2

# Do: title, table-of-contents ::fixed-width-sections |tables
# Do: ^:sup/sub with curly -:special-strings *:emphasis
# Don't: prop:no-prop-drawers \n:preserve-linebreaks ':use-smart-quotes
#+OPTIONS: prop:nil title:t toc:t \n:nil ::t |:t ^:{} -:t *:t ':nil
#+STARTUP: noalign entitiespretty hidestars noindent showall

#+begin_abstract
This document provides for the association of tags with YANG modules.
The expectation is for such tags to be used to help classify and
organize modules. A method for defining, reading and writing a
modules tags is provided. Tags may be standardized and assigned
during module definition; assigned by implementations; or dynamically
defined and set by users. This document also provides guidance to
future model writers; as such, this document updates RFC8407.
#+end_abstract

** Tags Module Tree

The tree associated with the "ietf-module-tags" module follows. The
meaning of the symbols can be found in [[RFC8340]].

#+NAME: YANG Module Tags Tree Diagram.
#+begin_src bash  :var file=ietf-module-tags :results output verbatim replace :wrap example :exports results
pyang --tree-print-groupings -f tree ${file} | sed -e 's/^/    /'
#+end_src

#+RESULTS: YANG Module Tags Tree Diagram.
#+begin_example
    module: ietf-module-tags
      +--rw module-tags
         +--rw module* [name]
            +--rw name          yang:yang-identifier
            +--rw tag*          tag
            +--rw masked-tag*   tag
#+end_example

* Examples

The following is a fictional NETCONF example result from a query of
the module tags list. For the sake of brevity only a few module
results are imagined.

#+NAME: validate-xml-example
#+HEADER: :var vfile=xml-example :var module=ietf-module-tags
#+begin_src bash :results output verbatim replace :wrap example :exports none
    if ! yang2dsdl -t config -d .validate -v ${vfile} $module 2>&1 > /dev/null; then echo FAIL; fi
#+end_src

#+RESULTS: validate-xml-example
#+begin_example
DSDL plugin supports only YANG version 1.
FAIL
#+end_example

#+NAME: xml-example
#+begin_src xml :file tests/test-xml-example.xml :results output code silent :exports code
  <ns0:data xmlns:ns0="urn:ietf:params:xml:ns:netconf:base:1.0">
    <t:module-tags xmlns:t="urn:ietf:params:xml:ns:yang:ietf-module-tags">
      <t:module>
        <t:name>ietf-bfd</t:name>
        <t:tag>ietf:network-element-class</t:tag>
        <t:tag>ietf:oam</t:tag>
        <t:tag>ietf:protocol</t:tag>
        <t:tag>ietf:sdo-defined-class</t:tag>
      </t:module>
      <t:module>
        <t:name>ietf-isis</t:name>
        <t:tag>ietf:network-element-class</t:tag>
        <t:tag>ietf:protocol</t:tag>
        <t:tag>ietf:sdo-defined-class</t:tag>
        <t:tag>ietf:routing</t:tag>
      </t:module>
      <t:module>
        <t:name>ietf-ssh-server</t:name>
        <t:tag>ietf:network-element-class</t:tag>
        <t:tag>ietf:protocol</t:tag>
        <t:tag>ietf:sdo-defined-class</t:tag>
        <t:tag>ietf:system-management</t:tag>
      </t:module>
    </t:module-tags>
  </ns0:data>
#+end_src

